Repository: honua-io/Honua.Server
Catalog: src/Honua.Server.Host/Resources/SharedResources.*.resx
Languages: de, es, fr, it, ja, pt

# FeatureNotFound
source: Feature '{0}' was not found.
de: Feature '{0}' wurde nicht gefunden.
es: No se encontró la entidad '{0}'.
fr: L'entité '{0}' est introuvable.
it: Feature '{0}' non trovato.
ja: 地物'{0}'が見つかりませんでした。
pt: A feição '{0}' não foi encontrada.

# FeatureNotFoundInLayer
source: Feature '{0}' was not found in layer '{1}'.
de: Feature '{0}' wurde in Ebene '{1}' nicht gefunden.
es: No se encontró la entidad '{0}' en la capa '{1}'.
fr: L'entité '{0}' est introuvable dans la couche '{1}'.
it: Feature '{0}' non trovato nel layer '{1}'.
ja: 地物'{0}'はレイヤ'{1}'内に見つかりませんでした。
pt: A feição '{0}' não foi encontrada na camada '{1}'.

# LayerNotFound
source: The requested layer was not found.
de: Die angeforderte Ebene wurde nicht gefunden.
es: No se encontró la capa solicitada.
fr: La couche demandée est introuvable.
it: Il layer richiesto non è stato trovato.
ja: 要求されたレイヤが見つかりませんでした。
pt: A camada solicitada não foi encontrada.

# LayerNotFoundWithId
source: Layer '{0}' was not found.
de: Ebene '{0}' wurde nicht gefunden.
es: No se encontró la capa '{0}'.
fr: La couche '{0}' est introuvable.
it: Layer '{0}' non trovato.
ja: レイヤ'{0}'が見つかりませんでした。
pt: A camada '{0}' não foi encontrada.

# CollectionNotFound
source: Collection '{0}' was not found.
de: Sammlung '{0}' wurde nicht gefunden.
es: No se encontró la colección '{0}'.
fr: La collection '{0}' est introuvable.
it: Collezione '{0}' non trovata.
ja: コレクション'{0}'が見つかりませんでした。
pt: A coleção '{0}' não foi encontrada.

# ServiceUnavailable
source: The service is temporarily unavailable. Please try again later.
de: Der Dienst ist vorübergehend nicht verfügbar. Bitte versuchen Sie es später erneut.
es: El servicio no está disponible temporalmente. Por favor, inténtelo de nuevo más tarde.
fr: Le service est temporairement indisponible. Veuillez réessayer ultérieurement.
it: Il servizio è temporaneamente non disponibile. Riprovare più tardi.
ja: サービスは一時的に利用できません。後でもう一度お試しください。
pt: O serviço está temporariamente indisponível. Por favor, tente novamente mais tarde.

# InvalidParameters
source: The request contains invalid parameters.
de: Die Anfrage enthält ungültige Parameter.
es: La solicitud contiene parámetros inválidos.
fr: La requête contient des paramètres non valides.
it: La richiesta contiene parametri non validi.
ja: リクエストに無効なパラメータが含まれています。
pt: A requisição contém parâmetros inválidos.

# InvalidGeometry
source: The geometry provided is invalid.
de: Die bereitgestellte Geometrie ist ungültig.
es: La geometría proporcionada es inválida.
fr: La géométrie fournie n'est pas valide.
it: La geometria fornita non è valida.
ja: 提供されたジオメトリが無効です。
pt: A geometria fornecida é inválida.

# InvalidBoundingBox
source: The bounding box '{0}' is invalid.
de: Die Bounding-Box '{0}' ist ungültig.
es: El cuadro delimitador '{0}' es inválido.
fr: La boîte englobante '{0}' n'est pas valide.
it: Il bounding box '{0}' non è valido.
ja: バウンディングボックス'{0}'が無効です。
pt: A caixa delimitadora '{0}' é inválida.

# InvalidCrs
source: The coordinate reference system '{0}' is not supported.
de: Das Koordinatenreferenzsystem '{0}' wird nicht unterstützt.
es: El sistema de referencia de coordenadas '{0}' no está soportado.
fr: Le système de référence de coordonnées '{0}' n'est pas pris en charge.
it: Il sistema di riferimento delle coordinate '{0}' non è supportato.
ja: 座標参照系'{0}'はサポートされていません。
pt: O sistema de referência de coordenadas '{0}' não é suportado.

# InvalidFormat
source: The format '{0}' is not supported.
de: Das Format '{0}' wird nicht unterstützt.
es: El formato '{0}' no está soportado.
fr: Le format '{0}' n'est pas pris en charge.
it: Il formato '{0}' non è supportato.
ja: フォーマット'{0}'はサポートされていません。
pt: O formato '{0}' não é suportado.

# DataStoreError
source: An error occurred while accessing the data store.
de: Beim Zugriff auf den Datenspeicher ist ein Fehler aufgetreten.
es: Ocurrió un error al acceder al almacén de datos.
fr: Une erreur s'est produite lors de l'accès au stockage de données.
it: Si è verificato un errore durante l'accesso all'archivio dati.
ja: データストアへのアクセス中にエラーが発生しました。
pt: Ocorreu um erro ao acessar o armazenamento de dados.

# CacheError
source: An error occurred while accessing the cache.
de: Beim Zugriff auf den Cache ist ein Fehler aufgetreten.
es: Ocurrió un error al acceder a la caché.
fr: Une erreur s'est produite lors de l'accès au cache.
it: Si è verificato un errore durante l'accesso alla cache.
ja: キャッシュへのアクセス中にエラーが発生しました。
pt: Ocorreu um erro ao acessar o cache.

# MetadataError
source: An error occurred while accessing metadata.
de: Beim Zugriff auf Metadaten ist ein Fehler aufgetreten.
es: Ocurrió un error al acceder a los metadatos.
fr: Une erreur s'est produite lors de l'accès aux métadonnées.
it: Si è verificato un errore durante l'accesso ai metadati.
ja: メタデータへのアクセス中にエラーが発生しました。
pt: Ocorreu um erro ao acessar os metadados.

# QueryError
source: An error occurred while executing the query.
de: Bei der Ausführung der Abfrage ist ein Fehler aufgetreten.
es: Ocurrió un error al ejecutar la consulta.
fr: Une erreur s'est produite lors de l'exécution de la requête.
it: Si è verificato un errore durante l'esecuzione della query.
ja: クエリの実行中にエラーが発生しました。
pt: Ocorreu um erro ao executar a consulta.

# RasterError
source: An error occurred while processing raster data.
de: Bei der Verarbeitung von Rasterdaten ist ein Fehler aufgetreten.
es: Ocurrió un error al procesar los datos ráster.
fr: Une erreur s'est produite lors du traitement des données matricielles.
it: Si è verificato un errore durante l'elaborazione dei dati raster.
ja: ラスタデータの処理中にエラーが発生しました。
pt: Ocorreu um erro ao processar dados raster.

# SerializationError
source: An error occurred while serializing the response.
de: Bei der Serialisierung der Antwort ist ein Fehler aufgetreten.
es: Ocurrió un error al serializar la respuesta.
fr: Une erreur s'est produite lors de la sérialisation de la réponse.
it: Si è verificato un errore durante la serializzazione della risposta.
ja: レスポンスのシリアライズ中にエラーが発生しました。
pt: Ocorreu um erro ao serializar a resposta.

# UnauthorizedAccess
source: You do not have permission to access this resource.
de: Sie haben keine Berechtigung, auf diese Ressource zuzugreifen.
es: No tiene permiso para acceder a este recurso.
fr: Vous n'avez pas l'autorisation d'accéder à cette ressource.
it: Non si dispone dell'autorizzazione per accedere a questa risorsa.
ja: このリソースにアクセスする権限がありません。
pt: Você não tem permissão para acessar este recurso.

# Forbidden
source: Access to this resource is forbidden.
de: Der Zugriff auf diese Ressource ist verboten.
es: El acceso a este recurso está prohibido.
fr: L'accès à cette ressource est interdit.
it: L'accesso a questa risorsa è vietato.
ja: このリソースへのアクセスは禁止されています。
pt: O acesso a este recurso é proibido.

# TooManyRequests
source: Too many requests. Please try again later.
de: Zu viele Anfragen. Bitte versuchen Sie es später erneut.
es: Demasiadas solicitudes. Por favor, inténtelo de nuevo más tarde.
fr: Trop de requêtes. Veuillez réessayer ultérieurement.
it: Troppe richieste. Riprovare più tardi.
ja: リクエストが多すぎます。後でもう一度お試しください。
pt: Muitas requisições. Por favor, tente novamente mais tarde.

# InternalServerError
source: An internal server error occurred.
de: Es ist ein interner Serverfehler aufgetreten.
es: Ocurrió un error interno del servidor.
fr: Une erreur interne du serveur s'est produite.
it: Si è verificato un errore interno del server.
ja: 内部サーバーエラーが発生しました。
pt: Ocorreu um erro interno do servidor.

# NotImplemented
source: This feature is not implemented.
de: Diese Funktion ist nicht implementiert.
es: Esta funcionalidad no está implementada.
fr: Cette fonctionnalité n'est pas implémentée.
it: Questa funzionalità non è implementata.
ja: この機能は実装されていません。
pt: Este recurso não está implementado.

# BadRequest
source: The request is malformed or invalid.
de: Die Anfrage ist fehlerhaft oder ungültig.
es: La solicitud está mal formada o es inválida.
fr: La requête est mal formée ou non valide.
it: La richiesta è malformata o non valida.
ja: リクエストが不正または無効です。
pt: A requisição está malformada ou inválida.

# MethodNotAllowed
source: The HTTP method '{0}' is not allowed for this resource.
de: Die HTTP-Methode '{0}' ist für diese Ressource nicht zulässig.
es: El método HTTP '{0}' no está permitido para este recurso.
fr: La méthode HTTP '{0}' n'est pas autorisée pour cette ressource.
it: Il metodo HTTP '{0}' non è consentito per questa risorsa.
ja: HTTPメソッド'{0}'はこのリソースでは許可されていません。
pt: O método HTTP '{0}' não é permitido para este recurso.

# UnsupportedMediaType
source: The media type '{0}' is not supported.
de: Der Medientyp '{0}' wird nicht unterstützt.
es: El tipo de medio '{0}' no está soportado.
fr: Le type de média '{0}' n'est pas pris en charge.
it: Il tipo di media '{0}' non è supportato.
ja: メディアタイプ'{0}'はサポートされていません。
pt: O tipo de mídia '{0}' não é suportado.

# ConflictError
source: The request conflicts with the current state of the resource.
de: Die Anfrage steht im Konflikt mit dem aktuellen Zustand der Ressource.
es: La solicitud entra en conflicto con el estado actual del recurso.
fr: La requête est en conflit avec l'état actuel de la ressource.
it: La richiesta è in conflitto con lo stato corrente della risorsa.
ja: リクエストがリソースの現在の状態と競合しています。
pt: A requisição conflita com o estado atual do recurso.

# GoneError
source: The requested resource is no longer available.
de: Die angeforderte Ressource ist nicht mehr verfügbar.
es: El recurso solicitado ya no está disponible.
fr: La ressource demandée n'est plus disponible.
it: La risorsa richiesta non è più disponibile.
ja: 要求されたリソースは利用できなくなりました。
pt: O recurso solicitado não está mais disponível.

# PreconditionFailed
source: Precondition failed for this request.
de: Vorbedingung für diese Anfrage fehlgeschlagen.
es: Falló la precondición para esta solicitud.
fr: La précondition a échoué pour cette requête.
it: Precondizione non soddisfatta per questa richiesta.
ja: このリクエストの事前条件が満たされませんでした。
pt: A pré-condição falhou para esta requisição.

# PayloadTooLarge
source: The request payload is too large.
de: Die Anfrage-Nutzlast ist zu groß.
es: La carga útil de la solicitud es demasiado grande.
fr: La charge utile de la requête est trop volumineuse.
it: Il payload della richiesta è troppo grande.
ja: リクエストペイロードが大きすぎます。
pt: A carga útil da requisição é muito grande.

# UriTooLong
source: The request URI is too long.
de: Die Anfrage-URI ist zu lang.
es: La URI de la solicitud es demasiado larga.
fr: L'URI de la requête est trop long.
it: L'URI della richiesta è troppo lungo.
ja: リクエストURIが長すぎます。
pt: O URI da requisição é muito longo.

# RequiredParameter
source: The parameter '{0}' is required.
de: Der Parameter '{0}' ist erforderlich.
es: El parámetro '{0}' es obligatorio.
fr: Le paramètre '{0}' est obligatoire.
it: Il parametro '{0}' è obbligatorio.
ja: パラメータ'{0}'は必須です。
pt: O parâmetro '{0}' é obrigatório.

# InvalidParameterValue
source: The value for parameter '{0}' is invalid.
de: Der Wert für Parameter '{0}' ist ungültig.
es: El valor para el parámetro '{0}' es inválido.
fr: La valeur du paramètre '{0}' n'est pas valide.
it: Il valore del parametro '{0}' non è valido.
ja: パラメータ'{0}'の値が無効です。
pt: O valor para o parâmetro '{0}' é inválido.

# ParameterOutOfRange
source: The parameter '{0}' is out of range. Expected between {1} and {2}.
de: Der Parameter '{0}' liegt außerhalb des gültigen Bereichs. Erwartet zwischen {1} und {2}.
es: El parámetro '{0}' está fuera de rango. Se esperaba entre {1} y {2}.
fr: Le paramètre '{0}' est hors limites. Attendu entre {1} et {2}.
it: Il parametro '{0}' è fuori intervallo. Previsto tra {1} e {2}.
ja: パラメータ'{0}'が範囲外です。{1}から{2}の間である必要があります。
pt: O parâmetro '{0}' está fora do intervalo. Esperado entre {1} e {2}.

# CollectionsTitle
source: Feature Collections
de: Feature-Sammlungen
es: Colecciones de Entidades
fr: Collections d'entités
it: Collezioni di Feature
ja: 地物コレクション
pt: Coleções de Feições

# CollectionsDescription
source: Access to data collections available in this API.
de: Zugriff auf Datensammlungen, die in dieser API verfügbar sind.
es: Acceso a las colecciones de datos disponibles en esta API.
fr: Accès aux collections de données disponibles dans cette API.
it: Accesso alle collezioni di dati disponibili in questa API.
ja: このAPIで利用可能なデータコレクションへのアクセス。
pt: Acesso às coleções de dados disponíveis nesta API.

# ConformanceTitle
source: Conformance Declaration
de: Konformitätserklärung
es: Declaración de Conformidad
fr: Déclaration de conformité
it: Dichiarazione di Conformità
ja: 準拠宣言
pt: Declaração de Conformidade

# ConformanceDescription
source: Information about the specifications and standards this API conforms to.
de: Informationen über die Spezifikationen und Standards, denen diese API entspricht.
es: Información sobre las especificaciones y estándares con los que esta API cumple.
fr: Informations sur les spécifications et normes auxquelles cette API se conforme.
it: Informazioni sulle specifiche e gli standard a cui questa API è conforme.
ja: このAPIが準拠する仕様および標準に関する情報。
pt: Informações sobre as especificações e padrões aos quais esta API está em conformidade.
