Repository: honua-io/Honua.Server
Catalog: src/Honua.Server.Host/Resources/ValidationResources.*.resx
Languages: de, es, fr, it, ja, pt

# ParameterTooLong
source: Parameter '{0}' exceeds maximum length of {1} characters (actual: {2}).
de: Parameter '{0}' überschreitet die maximale Länge von {1} Zeichen (tatsächlich: {2}).
es: El parámetro '{0}' excede la longitud máxima de {1} caracteres (actual: {2}).
fr: Le paramètre '{0}' dépasse la longueur maximale de {1} caractères (actuel : {2}).
it: Il parametro '{0}' supera la lunghezza massima di {1} caratteri (effettivo: {2}).
ja: パラメータ'{0}'が最大長{1}文字を超えています（実際: {2}）。
pt: O parâmetro '{0}' excede o comprimento máximo de {1} caracteres (atual: {2}).

# InvalidSqlPattern
source: Parameter '{0}' contains potentially unsafe SQL patterns.
de: Parameter '{0}' enthält potenziell unsichere SQL-Muster.
es: El parámetro '{0}' contiene patrones SQL potencialmente inseguros.
fr: Le paramètre '{0}' contient des modèles SQL potentiellement dangereux.
it: Il parametro '{0}' contiene pattern SQL potenzialmente non sicuri.
ja: パラメータ'{0}'に安全でない可能性のあるSQLパターンが含まれています。
pt: O parâmetro '{0}' contém padrões SQL potencialmente inseguros.

# InvalidCharacters
source: Parameter '{0}' contains invalid characters.
de: Parameter '{0}' enthält ungültige Zeichen.
es: El parámetro '{0}' contiene caracteres inválidos.
fr: Le paramètre '{0}' contient des caractères non valides.
it: Il parametro '{0}' contiene caratteri non validi.
ja: パラメータ'{0}'に無効な文字が含まれています。
pt: O parâmetro '{0}' contém caracteres inválidos.

# InvalidXmlPattern
source: Parameter '{0}' contains potentially unsafe XML patterns.
de: Parameter '{0}' enthält potenziell unsichere XML-Muster.
es: El parámetro '{0}' contiene patrones XML potencialmente inseguros.
fr: Le paramètre '{0}' contient des modèles XML potentiellement dangereux.
it: Il parametro '{0}' contiene pattern XML potenzialmente non sicuri.
ja: パラメータ'{0}'に安全でない可能性のあるXMLパターンが含まれています。
pt: O parâmetro '{0}' contém padrões XML potencialmente inseguros.

# InvalidPathTraversal
source: Parameter '{0}' contains path traversal sequences.
de: Parameter '{0}' enthält Pfaddurchlauf-Sequenzen.
es: El parámetro '{0}' contiene secuencias de recorrido de rutas.
fr: Le paramètre '{0}' contient des séquences de parcours de répertoires.
it: Il parametro '{0}' contiene sequenze di path traversal.
ja: パラメータ'{0}'にパストラバーサルシーケンスが含まれています。
pt: O parâmetro '{0}' contém sequências de travessia de diretório.

# InvalidScriptPattern
source: Parameter '{0}' contains potentially unsafe script patterns.
de: Parameter '{0}' enthält potenziell unsichere Skript-Muster.
es: El parámetro '{0}' contiene patrones de script potencialmente inseguros.
fr: Le paramètre '{0}' contient des modèles de script potentiellement dangereux.
it: Il parametro '{0}' contiene pattern di script potenzialmente non sicuri.
ja: パラメータ'{0}'に安全でない可能性のあるスクリプトパターンが含まれています。
pt: O parâmetro '{0}' contém padrões de script potencialmente inseguros.

# StringRequired
source: Parameter '{0}' is required and cannot be null or empty.
de: Parameter '{0}' ist erforderlich und darf nicht null oder leer sein.
es: El parámetro '{0}' es obligatorio y no puede ser nulo o vacío.
fr: Le paramètre '{0}' est obligatoire et ne peut pas être nul ou vide.
it: Il parametro '{0}' è obbligatorio e non può essere nullo o vuoto.
ja: パラメータ'{0}'は必須であり、nullまたは空にすることはできません。
pt: O parâmetro '{0}' é obrigatório e não pode ser nulo ou vazio.

# StringTooShort
source: Parameter '{0}' must be at least {1} characters long (actual: {2}).
de: Parameter '{0}' muss mindestens {1} Zeichen lang sein (tatsächlich: {2}).
es: El parámetro '{0}' debe tener al menos {1} caracteres de longitud (actual: {2}).
fr: Le paramètre '{0}' doit comporter au moins {1} caractères (actuel : {2}).
it: Il parametro '{0}' deve essere lungo almeno {1} caratteri (effettivo: {2}).
ja: パラメータ'{0}'は最低{1}文字である必要があります（実際: {2}）。
pt: O parâmetro '{0}' deve ter pelo menos {1} caracteres (atual: {2}).

# InvalidEmailFormat
source: Parameter '{0}' is not a valid email address.
de: Parameter '{0}' ist keine gültige E-Mail-Adresse.
es: El parámetro '{0}' no es una dirección de correo electrónico válida.
fr: Le paramètre '{0}' n'est pas une adresse électronique valide.
it: Il parametro '{0}' non è un indirizzo email valido.
ja: パラメータ'{0}'は有効なメールアドレスではありません。
pt: O parâmetro '{0}' não é um endereço de e-mail válido.

# InvalidUrlFormat
source: Parameter '{0}' is not a valid URL.
de: Parameter '{0}' ist keine gültige URL.
es: El parámetro '{0}' no es una URL válida.
fr: Le paramètre '{0}' n'est pas une URL valide.
it: Il parametro '{0}' non è un URL valido.
ja: パラメータ'{0}'は有効なURLではありません。
pt: O parâmetro '{0}' não é uma URL válida.

# InvalidDateTimeFormat
source: Parameter '{0}' is not a valid date/time format.
de: Parameter '{0}' ist kein gültiges Datum/Uhrzeit-Format.
es: El parámetro '{0}' no es un formato de fecha/hora válido.
fr: Le paramètre '{0}' n'est pas un format de date/heure valide.
it: Il parametro '{0}' non è in un formato data/ora valido.
ja: パラメータ'{0}'は有効な日付/時刻フォーマットではありません。
pt: O parâmetro '{0}' não é um formato de data/hora válido.

# InvalidNumberFormat
source: Parameter '{0}' is not a valid number.
de: Parameter '{0}' ist keine gültige Zahl.
es: El parámetro '{0}' no es un número válido.
fr: Le paramètre '{0}' n'est pas un nombre valide.
it: Il parametro '{0}' non è un numero valido.
ja: パラメータ'{0}'は有効な数値ではありません。
pt: O parâmetro '{0}' não é um número válido.

# NumberTooSmall
source: Parameter '{0}' must be at least {1} (actual: {2}).
de: Parameter '{0}' muss mindestens {1} sein (tatsächlich: {2}).
es: El parámetro '{0}' debe ser al menos {1} (actual: {2}).
fr: Le paramètre '{0}' doit être au moins {1} (actuel : {2}).
it: Il parametro '{0}' deve essere almeno {1} (effettivo: {2}).
ja: パラメータ'{0}'は最低{1}である必要があります（実際: {2}）。
pt: O parâmetro '{0}' deve ser pelo menos {1} (atual: {2}).

# NumberTooLarge
source: Parameter '{0}' must be at most {1} (actual: {2}).
de: Parameter '{0}' darf höchstens {1} sein (tatsächlich: {2}).
es: El parámetro '{0}' debe ser como máximo {1} (actual: {2}).
fr: Le paramètre '{0}' doit être au maximum {1} (actuel : {2}).
it: Il parametro '{0}' deve essere al massimo {1} (effettivo: {2}).
ja: パラメータ'{0}'は最大{1}である必要があります（実際: {2}）。
pt: O parâmetro '{0}' deve ser no máximo {1} (atual: {2}).

# InvalidEnumValue
source: Parameter '{0}' has an invalid value. Valid values are: {1}.
de: Parameter '{0}' hat einen ungültigen Wert. Gültige Werte sind: {1}.
es: El parámetro '{0}' tiene un valor inválido. Los valores válidos son: {1}.
fr: Le paramètre '{0}' a une valeur non valide. Les valeurs valides sont : {1}.
it: Il parametro '{0}' ha un valore non valido. I valori validi sono: {1}.
ja: パラメータ'{0}'の値が無効です。有効な値: {1}。
pt: O parâmetro '{0}' possui um valor inválido. Valores válidos são: {1}.

# InvalidGuidFormat
source: Parameter '{0}' is not a valid GUID format.
de: Parameter '{0}' ist kein gültiges GUID-Format.
es: El parámetro '{0}' no es un formato GUID válido.
fr: Le paramètre '{0}' n'est pas un format GUID valide.
it: Il parametro '{0}' non è in un formato GUID valido.
ja: パラメータ'{0}'は有効なGUIDフォーマットではありません。
pt: O parâmetro '{0}' não é um formato GUID válido.

# InvalidRegexPattern
source: Parameter '{0}' does not match the required pattern.
de: Parameter '{0}' entspricht nicht dem erforderlichen Muster.
es: El parámetro '{0}' no coincide con el patrón requerido.
fr: Le paramètre '{0}' ne correspond pas au modèle requis.
it: Il parametro '{0}' non corrisponde al pattern richiesto.
ja: パラメータ'{0}'が必要なパターンと一致しません。
pt: O parâmetro '{0}' não corresponde ao padrão exigido.

# CollectionEmpty
source: Parameter '{0}' must contain at least one item.
de: Parameter '{0}' muss mindestens ein Element enthalten.
es: El parámetro '{0}' debe contener al menos un elemento.
fr: Le paramètre '{0}' doit contenir au moins un élément.
it: Il parametro '{0}' deve contenere almeno un elemento.
ja: パラメータ'{0}'には最低1つの項目が含まれている必要があります。
pt: O parâmetro '{0}' deve conter pelo menos um item.

# CollectionTooLarge
source: Parameter '{0}' contains too many items. Maximum allowed: {1} (actual: {2}).
de: Parameter '{0}' enthält zu viele Elemente. Maximal erlaubt: {1} (tatsächlich: {2}).
es: El parámetro '{0}' contiene demasiados elementos. Máximo permitido: {1} (actual: {2}).
fr: Le paramètre '{0}' contient trop d'éléments. Maximum autorisé : {1} (actuel : {2}).
it: Il parametro '{0}' contiene troppi elementi. Massimo consentito: {1} (effettivo: {2}).
ja: パラメータ'{0}'に含まれる項目が多すぎます。最大許容数: {1}（実際: {2}）。
pt: O parâmetro '{0}' contém muitos itens. Máximo permitido: {1} (atual: {2}).

# DuplicateValue
source: Parameter '{0}' contains duplicate values. All values must be unique.
de: Parameter '{0}' enthält doppelte Werte. Alle Werte müssen eindeutig sein.
es: El parámetro '{0}' contiene valores duplicados. Todos los valores deben ser únicos.
fr: Le paramètre '{0}' contient des valeurs en double. Toutes les valeurs doivent être uniques.
it: Il parametro '{0}' contiene valori duplicati. Tutti i valori devono essere univoci.
ja: パラメータ'{0}'に重複した値が含まれています。すべての値は一意である必要があります。
pt: O parâmetro '{0}' contém valores duplicados. Todos os valores devem ser únicos.

# GeometryInvalid
source: The geometry is invalid: {0}
de: Die Geometrie ist ungültig: {0}
es: La geometría es inválida: {0}
fr: La géométrie n'est pas valide : {0}
it: La geometria non è valida: {0}
ja: ジオメトリが無効です: {0}
pt: A geometria é inválida: {0}

# GeometryTooComplex
source: The geometry is too complex. Maximum {0} vertices allowed (actual: {1}).
de: Die Geometrie ist zu komplex. Maximal {0} Stützpunkte erlaubt (tatsächlich: {1}).
es: La geometría es demasiado compleja. Máximo de {0} vértices permitidos (actual: {1}).
fr: La géométrie est trop complexe. Maximum {0} sommets autorisés (actuel : {1}).
it: La geometria è troppo complessa. Massimo {0} vertici consentiti (effettivo: {1}).
ja: ジオメトリが複雑すぎます。最大{0}頂点まで許可されています（実際: {1}）。
pt: A geometria é muito complexa. Máximo de {0} vértices permitidos (atual: {1}).

# GeometrySelfIntersecting
source: The geometry is self-intersecting.
de: Die Geometrie hat Selbstüberschneidungen.
es: La geometría se auto-intersecta.
fr: La géométrie s'auto-intersecte.
it: La geometria si auto-interseca.
ja: ジオメトリが自己交差しています。
pt: A geometria possui auto-interseção.

# GeometryNotClosed
source: The polygon geometry is not closed.
de: Die Polygon-Geometrie ist nicht geschlossen.
es: La geometría del polígono no está cerrada.
fr: La géométrie du polygone n'est pas fermée.
it: La geometria del poligono non è chiusa.
ja: ポリゴンジオメトリが閉じていません。
pt: A geometria do polígono não está fechada.

# InvalidCoordinates
source: The coordinates are invalid or out of bounds.
de: Die Koordinaten sind ungültig oder außerhalb der Grenzen.
es: Las coordenadas son inválidas o están fuera de los límites.
fr: Les coordonnées sont non valides ou hors limites.
it: Le coordinate non sono valide o fuori dai limiti.
ja: 座標が無効または範囲外です。
pt: As coordenadas são inválidas ou estão fora dos limites.

# CoordinateOutOfRange
source: Coordinate value {0} is out of range for {1}. Expected between {2} and {3}.
de: Koordinatenwert {0} liegt außerhalb des gültigen Bereichs für {1}. Erwartet zwischen {2} und {3}.
es: El valor de coordenada {0} está fuera de rango para {1}. Se esperaba entre {2} y {3}.
fr: La valeur de coordonnée {0} est hors limites pour {1}. Attendue entre {2} et {3}.
it: Il valore della coordinata {0} è fuori intervallo per {1}. Previsto tra {2} e {3}.
ja: 座標値{0}は{1}の範囲外です。{2}から{3}の間である必要があります。
pt: O valor da coordenada {0} está fora do intervalo para {1}. Esperado entre {2} e {3}.
